test/wrk2_wsk/media_microservice/qps_1000_org/output_compose-review-async_1.log
Running 15m test @ http://130.127.133.30:32001
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.81m     4.13m   14.95m    57.84%
    Req/Sec     0.98     10.08   111.00     99.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.82m 
 75.000%   11.39m 
 90.000%   13.54m 
 99.000%   14.82m 
 99.900%   14.96m 
 99.990%   14.96m 
 99.999%   14.96m 
100.000%   14.96m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   29392.895     0.000000            1         1.00
  125566.975     0.100000           84         1.11
  211288.063     0.200000          167         1.25
  297533.439     0.300000          251         1.43
  382730.239     0.400000          334         1.67
  468975.615     0.500000          418         2.00
  512229.375     0.550000          460         2.22
  554172.415     0.600000          501         2.50
  597164.031     0.650000          543         2.86
  640155.647     0.700000          585         3.33
  683671.551     0.750000          627         4.00
  705691.647     0.775000          648         4.44
  726663.167     0.800000          669         5.00
  747110.399     0.825000          689         5.71
  769654.783     0.850000          711         6.67
  790102.015     0.875000          731         8.00
  802684.927     0.887500          743         8.89
  812646.399     0.900000          752        10.00
  823132.159     0.912500          763        11.43
  833617.919     0.925000          773        13.33
  843579.391     0.937500          783        16.00
  849870.847     0.943750          789        17.78
  856162.303     0.950000          795        20.00
  860356.607     0.956250          799        22.86
  866648.063     0.962500          805        26.67
  870318.079     0.968750          809        32.00
  874512.383     0.971875          813        35.56
  876609.535     0.975000          815        40.00
  878706.687     0.978125          817        45.71
  882900.991     0.981250          821        53.33
  884998.143     0.984375          823        64.00
  887095.295     0.985938          825        71.11
  887095.295     0.987500          825        80.00
  889192.447     0.989062          827        91.43
  891289.599     0.990625          829       106.67
  891289.599     0.992188          829       128.00
  893386.751     0.992969          831       142.22
  893386.751     0.993750          831       160.00
  893386.751     0.994531          831       182.86
  895483.903     0.995313          833       213.33
  895483.903     0.996094          833       256.00
  895483.903     0.996484          833       284.44
  895483.903     0.996875          833       320.00
  895483.903     0.997266          833       365.71
  897581.055     0.997656          835       426.67
  897581.055     1.000000          835          inf
#[Mean    =   468799.179, StdDeviation   =   247819.753]
#[Max     =   897056.768, Total count    =          835]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.03s 
 75.000%    1.30s 
 90.000%    1.94s 
 99.000%    2.08s 
 99.900%    2.17s 
 99.990%   29.39s 
 99.999%   29.39s 
100.000%   29.39s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      62.687     0.000000            1         1.00
     146.559     0.100000           84         1.11
     676.351     0.200000          167         1.25
     841.215     0.300000          251         1.43
     924.159     0.400000          334         1.67
    1034.751     0.500000          419         2.00
    1098.751     0.550000          460         2.22
    1132.543     0.600000          502         2.50
    1181.695     0.650000          543         2.86
    1221.631     0.700000          585         3.33
    1300.479     0.750000          627         4.00
    1351.679     0.775000          648         4.44
    1396.735     0.800000          668         5.00
    1608.703     0.825000          689         5.71
    1714.175     0.850000          710         6.67
    1862.655     0.875000          731         8.00
    1906.687     0.887500          742         8.89
    1942.527     0.900000          752        10.00
    1953.791     0.912500          764        11.43
    1964.031     0.925000          773        13.33
    1983.487     0.937500          784        16.00
    1986.559     0.943750          790        17.78
    1988.607     0.950000          798        20.00
    1989.631     0.956250          801        22.86
    1991.679     0.962500          810        26.67
    1991.679     0.968750          810        32.00
    1993.727     0.971875          814        35.56
    1994.751     0.975000          816        40.00
    1996.799     0.978125          817        45.71
    2000.895     0.981250          820        53.33
    2002.943     0.984375          822        64.00
    2039.807     0.985938          824        71.11
    2044.927     0.987500          825        80.00
    2053.119     0.989062          826        91.43
    2079.743     0.990625          828       106.67
    2131.967     0.992188          829       128.00
    2134.015     0.992969          831       142.22
    2134.015     0.993750          831       160.00
    2134.015     0.994531          831       182.86
    2136.063     0.995313          832       213.33
    2136.063     0.996094          832       256.00
    2144.255     0.996484          833       284.44
    2144.255     0.996875          833       320.00
    2144.255     0.997266          833       365.71
    2172.927     0.997656          834       426.67
    2172.927     0.998047          834       512.00
    2172.927     0.998242          834       568.89
    2172.927     0.998437          834       640.00
    2172.927     0.998633          834       731.43
   29392.895     0.998828          835       853.33
   29392.895     1.000000          835          inf
#[Mean    =     1073.813, StdDeviation   =     1120.248]
#[Max     =    29376.512, Total count    =          835]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  836 requests in 15.00m, 391.06KB read
  Socket errors: connect 0, read 0, write 0, timeout 15
Requests/sec:      0.93
Transfer/sec:     444.91B