test/wrk2_wsk/media_microservice/qps_1000_org/output_compose-review-async_4.log
Running 15m test @ http://130.127.133.30:32001
  1 threads and 4 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.64m     4.21m   14.92m    57.70%
    Req/Sec     3.50     25.85   444.00     97.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.63m 
 75.000%   11.30m 
 90.000%   13.48m 
 99.000%   14.79m 
 99.900%   14.92m 
 99.990%   14.92m 
 99.999%   14.92m 
100.000%   14.92m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   13156.351     0.000000            1         1.00
  109117.439     0.100000          301         1.11
  195559.423     0.200000          598         1.25
  283377.663     0.300000          897         1.43
  371720.191     0.400000         1200         1.67
  457965.567     0.500000         1494         2.00
  502792.191     0.550000         1645         2.22
  546308.095     0.600000         1795         2.50
  589299.711     0.650000         1942         2.86
  634388.479     0.700000         2094         3.33
  677904.383     0.750000         2244         4.00
  700448.767     0.775000         2321         4.44
  720895.999     0.800000         2391         5.00
  743440.383     0.825000         2468         5.71
  765984.767     0.850000         2545         6.67
  786431.999     0.875000         2615         8.00
  799014.911     0.887500         2657         8.89
  808976.383     0.900000         2692        10.00
  819462.143     0.912500         2727        11.43
  831520.767     0.925000         2769        13.33
  842006.527     0.937500         2804        16.00
  848297.983     0.943750         2825        17.78
  852492.287     0.950000         2839        20.00
  858259.455     0.956250         2860        22.86
  864550.911     0.962500         2881        26.67
  868745.215     0.968750         2895        32.00
  872939.519     0.971875         2909        35.56
  875036.671     0.975000         2916        40.00
  877133.823     0.978125         2923        45.71
  880803.839     0.981250         2935        53.33
  882900.991     0.984375         2943        64.00
  885522.431     0.985938         2951        71.11
  885522.431     0.987500         2951        80.00
  887619.583     0.989062         2958        91.43
  889192.447     0.990625         2961       106.67
  889716.735     0.992188         2965       128.00
  891289.599     0.992969         2969       142.22
  891289.599     0.993750         2969       160.00
  891813.887     0.994531         2972       182.86
  893386.751     0.995313         2978       213.33
  893386.751     0.996094         2978       256.00
  893386.751     0.996484         2978       284.44
  893386.751     0.996875         2978       320.00
  893386.751     0.997266         2978       365.71
  895483.903     0.997656         2986       426.67
  895483.903     1.000000         2986          inf
#[Mean    =   458371.009, StdDeviation   =   252670.082]
#[Max     =   894959.616, Total count    =         2986]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.30s 
 75.000%    1.97s 
 90.000%    2.02s 
 99.000%    2.07s 
 99.900%   13.16s 
 99.990%   16.11s 
 99.999%   16.11s 
100.000%   16.11s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      60.671     0.000000            1         1.00
      78.271     0.100000          299         1.11
     127.295     0.200000          598         1.25
     416.511     0.300000          896         1.43
     979.455     0.400000         1196         1.67
    1301.503     0.500000         1493         2.00
    1652.735     0.550000         1643         2.22
    1727.487     0.600000         1792         2.50
    1913.855     0.650000         1941         2.86
    1947.647     0.700000         2093         3.33
    1971.199     0.750000         2243         4.00
    1978.367     0.775000         2323         4.44
    1982.463     0.800000         2407         5.00
    1986.559     0.825000         2487         5.71
    1989.631     0.850000         2546         6.67
    1994.751     0.875000         2615         8.00
    2009.087     0.887500         2652         8.89
    2020.351     0.900000         2688        10.00
    2031.615     0.912500         2726        11.43
    2042.879     0.925000         2764        13.33
    2047.999     0.937500         2803        16.00
    2050.047     0.943750         2820        17.78
    2052.095     0.950000         2842        20.00
    2053.119     0.956250         2858        22.86
    2055.167     0.962500         2886        26.67
    2056.191     0.968750         2899        32.00
    2057.215     0.971875         2915        35.56
    2057.215     0.975000         2915        40.00
    2058.239     0.978125         2922        45.71
    2060.287     0.981250         2933        53.33
    2063.359     0.984375         2945        64.00
    2063.359     0.985938         2945        71.11
    2064.383     0.987500         2949        80.00
    2069.503     0.989062         2954        91.43
    2075.647     0.990625         2959       106.67
    2105.343     0.992188         2964       128.00
    2144.255     0.992969         2966       142.22
    2174.975     0.993750         2968       160.00
    2240.511     0.994531         2970       182.86
    2248.703     0.995313         2973       213.33
    2303.999     0.996094         2975       256.00
    2310.143     0.996484         2976       284.44
    3065.855     0.996875         2977       320.00
    3108.863     0.997266         2978       365.71
    3772.415     0.997656         2980       426.67
    3819.519     0.998047         2981       512.00
    3819.519     0.998242         2981       568.89
    3989.503     0.998437         2982       640.00
    3989.503     0.998633         2982       731.43
   13156.351     0.998828         2983       853.33
   14073.855     0.999023         2984      1024.00
   14073.855     0.999121         2984      1137.78
   14073.855     0.999219         2984      1280.00
   14073.855     0.999316         2984      1462.86
   15187.967     0.999414         2985      1706.67
   15187.967     0.999512         2985      2048.00
   15187.967     0.999561         2985      2275.56
   15187.967     0.999609         2985      2560.00
   15187.967     0.999658         2985      2925.71
   16113.663     0.999707         2986      3413.33
   16113.663     1.000000         2986          inf
#[Mean    =     1201.744, StdDeviation   =      936.815]
#[Max     =    16105.472, Total count    =         2986]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2986 requests in 15.00m, 1.36MB read
  Socket errors: connect 0, read 0, write 0, timeout 41
Requests/sec:      3.32
Transfer/sec:      1.55KB